# SketchedStairsCurveData Class

---
Sketched run/landing curves overrides with height and slope
SystemObject Autodesk.Revit.DBSketchedStairsCurveData
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class SketchedStairsCurveData : IDisposable

    Public Class SketchedStairsCurveData
    	Implements IDisposable

    public ref class SketchedStairsCurveData : IDisposable

    type SketchedStairsCurveData =
        class
            interface IDisposable
        end
The SketchedStairsCurveData type exposes the following members.
| Name| Description
---|---|---
| SketchedStairsCurveData|  Construct a SketchedStairsCurveData defined by a curve associated with its height and slope type.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the SketchedStairsCurveData
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetCurve|  Get a copy of the curve that is formed along this boundary.
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace